app/controllers/pins_controller.rb

    def create
        @pin = current_user.pins.build(pin_params)

        if @pin.save
---
INSERT INTO "pins" ("title", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "description" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?